#+title: Scripts
#+description: These are little modules I'd like to include in my nushell config

**** Example

#+name: xdg-config-example
#+begin_src nushell :noweb yes
<<xdg-config>>
config | print
config nushell this is a really good example
#+end_src

#+RESULTS: xdg-config-example
: /Users/michael/.config
: /Users/michael/.config/nushell/this/is/a/really/good/example

**** Example

#+name: xdg-cache-example
#+begin_src nushell :noweb yes
<<xdg-cache>>
cache | print
cache this is a great example actually
#+end_src

#+RESULTS: xdg-cache-example
: /Users/michael/.cache
: /Users/michael/.cache/this/is/a/great/example/actually

**** Example

#+name: xdg-data-example
#+begin_src nushell :noweb yes
<<xdg-data>>
data | print
data this is a great example actually
#+end_src

#+RESULTS: xdg-data-example
: /Users/michael/.local/share
: /Users/michael/.local/share/this/is/a/great/example/actually


**** Example

#+name: xdg-state-example
#+begin_src nushell :noweb yes
<<xdg-state>>
state | print
state this is a great example actually
#+end_src

#+RESULTS: xdg-state-example
: /Users/michael/.local/state
: /Users/michael/.local/state/this/is/a/great/example/actually


**** Example

#+name: xdg-runtime-example
#+begin_src nushell :noweb yes
<<xdg-runtime>>
runtime | print
runtime this is a great example actually
#+end_src

#+RESULTS: xdg-runtime-example
: /var/folders/rb/3dlc977d1xd_5m1fz4sg3q2r0000gn/T/
: /var/folders/rb/3dlc977d1xd_5m1fz4sg3q2r0000gn/T/this/is/a/great/example/actually



